cases/elbow/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.1;

vertices
(
    (4 0 0)
    (5 0 0)
    (0 4 0)
    (4 4 0)
    (5 4 0)
    (0 5 0)
    (4 5 0)
    (5 5 0)
    (4 0 0.1)
    (5 0 0.1)
    (0 4 0.1)
    (4 4 0.1)
    (5 4 0.1)
    (0 5 0.1)
    (4 5 0.1)
    (5 5 0.1)
);

blocks
(
    hex (2 3 6 5 10 11 14 13) (128 32 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (32 32 1) simpleGrading (1 1 1)
    hex (0 1 4 3 8 9 12 11) (32 128 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (15 7 6 14)
            (14 6 5 13)
            (7 15 12 4)
            (4 12 9 1)
            (11 3 0 8)
            (3 11 10 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (13 5 2 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 0 1 9)
        );
    }
    empties
    {
        type empty;
        faces
        (
            (13 10 11 14)
            (14 11 12 15)
            (11 8 9 12)
            (5 6 3 2)
            (6 7 4 3)
            (3 4 1 0)
        );
    }
);

mergePatchPairs
(
);
