cases/elbow/0.org/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        zeroGradient;
    }

    walls
    {
        type        noSlip;
    }

    empties
    {
        type        empty;
    }
}
